{
  "schema_version": 1,
  "task_id": "TASK-TEAM-001",
  "intent_id": "INT-030",
  "title": "Bib-color team assignment with smoothing",
  "status": "done",
  "scope": [
    "Assign each player track to Team A / Team B / Unknown based on bib colors with temporal smoothing.",
    "Expose diagnostics explaining team decisions (color evidence, smoothing, Unknown reasons).",
    "Do not attempt jersey-number OCR or advanced re-identification (out of scope for V1)."
  ],
  "acceptance": [
    "Team assignment includes an explicit Unknown state and does not force assignment when evidence is weak.",
    "Outputs include diagnostics supporting audits and debugging.",
    "Team assignment record includes a stable minimal field set: team (A|B|unknown), team_confidence (0..1), and smoothing parameters (e.g., window size / hysteresis) plus diagnostics.",
    "Negative path: when bib-color evidence is ambiguous or unstable (e.g., lighting shifts), output Unknown with diagnostics rather than oscillating A/B.",
    "All edited code units include requirement provenance tags as applicable (e.g., FUSBAL-V1-TEAM-001 and/or FUSBAL-V1-TRUST-001), consistent with repo guardrails.",
    "Output contract template documents team assignment fields, smoothing parameters, Unknown semantics, and diagnostics with example records."
  ],
  "deliverables": [
    {
      "deliverable_id": "DELIV-TASK-TEAM-001-001",
      "title": "Team assignment A/B/Unknown with diagnostics",
      "paths": [
        "pipeline/src/fusbal_pipeline/team/assignment.py",
        "pipeline/src/fusbal_pipeline/team/colors.py",
        "pipeline/src/fusbal_pipeline/contract.py",
        "spec/md/docs/data/OUTPUT_CONTRACT.mdt"
      ],
      "acceptance": [
        "Team assignment outputs A/B/Unknown with confidence and diagnostics.",
        "Smoothing is explicit and configurable; Unknown is used when uncertain."
      ],
      "evidence": [
        "A minimal pipeline run produces team assignment fields and diagnostics."
      ]
    },
    {
      "deliverable_id": "DELIV-TASK-TEAM-001-002",
      "title": "Output contract template updated for team assignment",
      "paths": [
        "spec/md/docs/data/OUTPUT_CONTRACT.mdt"
      ],
      "acceptance": [
        "Contract documents team assignment schema, smoothing semantics, and Unknown behavior."
      ],
      "evidence": [
        "`npm run generate` renders docs reflecting the updated contract template."
      ]
    }
  ],
  "subtasks": [
    {
      "subtask_id": "SUB-TASK-TEAM-001-001",
      "title": "Implement bib-color team assignment with smoothing and diagnostics (A/B/Unknown).",
      "status": "done",
      "area": "pipeline",
      "provenance_prefix": "FUSBAL.PIPELINE.TASK_TEAM_001.SUB_001",
      "done_when": [
        "Team assignment is computed from color evidence with temporal smoothing.",
        "Unknown is emitted when evidence is insufficient; diagnostics explain why."
      ]
    },
    {
      "subtask_id": "SUB-TASK-TEAM-001-002",
      "title": "Update output contract template for team assignment fields.",
      "status": "done",
      "area": "spec",
      "provenance_prefix": "FUSBAL.SPEC.TASK_TEAM_001.SUB_002",
      "done_when": [
        "Contract template documents assignment fields, confidence, diagnostics, and Unknown semantics."
      ]
    },
    {
      "subtask_id": "SUB-TASK-TEAM-001-003",
      "title": "Define canonical team assignment record fields and diagnostics.",
      "status": "done",
      "area": "pipeline",
      "provenance_prefix": "FUSBAL.PIPELINE.TASK_TEAM_001.SUB_003",
      "done_when": [
        "Record schema is explicit (team label, confidence, evidence/diagnostics).",
        "Schema supports audits without reading implementation code."
      ]
    }
  ]
}
