{
  "schema_version": 1,
  "task_id": "TASK-PLAYER-MOT-001",
  "intent_id": "INT-030",
  "title": "Multi-object tracking with swap avoidance",
  "status": "done",
  "scope": [
    "Track players over time from per-frame detections, prioritizing swap avoidance over continuity.",
    "Expose track confidence and explicit break reasons (e.g., occlusion, ambiguity).",
    "Do not finalize team identity here (handled by team assignment task)."
  ],
  "acceptance": [
    "Tracks prefer breaks over identity swaps; ambiguity triggers a break reason.",
    "Each track has confidence and diagnostic fields suitable for audits and downstream gating.",
    "Track record includes a stable minimal field set: track_id, segment_id (or explicit segment boundaries), start_frame/end_frame (or timestamps), confidence (0..1), and break_reason when a segment ends.",
    "Negative path: in overlap/occlusion/ambiguous association, tracking emits a break (not a swap) with an explicit break_reason and records missing/unknown segments rather than silently bridging gaps.",
    "break_reason vocabulary is explicit and finite (minimum: occlusion, ambiguous_association, out_of_view, detector_missing, manual_reset).",
    "All edited code units include requirement provenance tags as applicable (e.g., FUSBAL-V1-PLAYER-001 and/or FUSBAL-V1-TRUST-001), consistent with repo guardrails.",
    "Output contract template documents track schema, confidence, and break reasons (including an explicit break_reason vocabulary and example records)."
  ],
  "deliverables": [
    {
      "deliverable_id": "DELIV-TASK-PLAYER-MOT-001-001",
      "title": "MOT tracking with break reasons and confidence",
      "paths": [
        "pipeline/src/fusbal_pipeline/player/mot.py",
        "pipeline/src/fusbal_pipeline/player/track_types.py",
        "pipeline/src/fusbal_pipeline/contract.py",
        "spec/md/docs/data/OUTPUT_CONTRACT.mdt"
      ],
      "acceptance": [
        "Track records include confidence and explicit break reasons.",
        "Swap avoidance is a stated design goal with observable diagnostics."
      ],
      "evidence": [
        "A minimal pipeline run produces player tracks with confidence and break reasons."
      ]
    },
    {
      "deliverable_id": "DELIV-TASK-PLAYER-MOT-001-002",
      "title": "Output contract template updated for player tracks",
      "paths": [
        "spec/md/docs/data/OUTPUT_CONTRACT.mdt"
      ],
      "acceptance": [
        "Contract documents player track schema and trust-first break semantics."
      ],
      "evidence": [
        "`npm run generate` renders docs reflecting the updated contract template."
      ]
    }
  ],
  "subtasks": [
    {
      "subtask_id": "SUB-TASK-PLAYER-MOT-001-001",
      "title": "Implement MOT with swap avoidance, break reasons, and per-track confidence.",
      "status": "done",
      "area": "pipeline",
      "provenance_prefix": "FUSBAL.PIPELINE.TASK_PLAYER_MOT_001.SUB_001",
      "done_when": [
        "Tracker exposes explicit break reasons and confidence per track.",
        "Association logic prefers breaking over swapping identity in ambiguous cases."
      ]
    },
    {
      "subtask_id": "SUB-TASK-PLAYER-MOT-001-002",
      "title": "Update output contract template for player tracks and confidence fields.",
      "status": "done",
      "area": "spec",
      "provenance_prefix": "FUSBAL.SPEC.TASK_PLAYER_MOT_001.SUB_002",
      "done_when": [
        "Contract template documents track schema, confidence, and break reasons with examples."
      ]
    },
    {
      "subtask_id": "SUB-TASK-PLAYER-MOT-001-003",
      "title": "Define track record schema (ids, segments, confidence, break semantics).",
      "status": "done",
      "area": "pipeline",
      "provenance_prefix": "FUSBAL.PIPELINE.TASK_PLAYER_MOT_001.SUB_003",
      "done_when": [
        "Track record schema is explicit and stable across runs.",
        "Missing/unknown semantics are documented and encoded (no silent gaps)."
      ]
    }
  ]
}
