{
  "schema_version": 1,
  "task_id": "TASK-INT-010-IMP-007",
  "intent_id": "INT-010",
  "title": "Export the V1 contract as JSON Schema for downstream validators",
  "status": "done",
  "scope": [
    "Provide JSON Schema files that represent the V1 contract for downstream validation in other languages/tools.",
    "Keep schemas deterministic and versioned.",
    "Do not require reading Python code to obtain the schema.",
    "Schema scope is record-level + manifest-level objects (TrackRecordV1, EventRecordV1, MatchManifestV1), not the full on-disk bundle directory structure."
  ],
  "acceptance": [
    "A versioned JSON Schema file exists for the V1 contract and is checked into the repo.",
    "The schema declares an explicit JSON Schema draft/version (e.g. 2020-12) via `$schema`.",
    "The schema includes definitions for: TrackRecordV1, EventRecordV1, and MatchManifestV1 (or equivalent named definitions) and aligns with the documented contract fields and semantics.",
    "A sample track record, event record, and manifest can each be validated against the schema using an off-the-shelf JSON Schema validator."
  ],
  "deliverables": [
    {
      "deliverable_id": "DELIV-TASK-INT-010-IMP-007-001",
      "title": "V1 JSON Schema artefacts and generation/maintenance strategy",
      "paths": [
        "pipeline/schemas/contract.v1.schema.json",
        "pipeline/src/fusbal_pipeline/contract.py"
      ],
      "acceptance": [
        "Schema file is versioned and stored under `pipeline/schemas/`.",
        "Schema content is deterministic (stable ordering/formatting) and includes named definitions for the manifest + record objects.",
        "Contract code references or documents schema version alignment."
      ],
      "evidence": [
        "A sample record validates against the schema.",
        "A schema violation is reported with a clear reason by a validator."
      ]
    }
  ],
  "subtasks": [
    {
      "subtask_id": "SUB-TASK-INT-010-IMP-007-001",
      "title": "Define and commit JSON Schema artefacts for the V1 contract.",
      "status": "done",
      "area": "pipeline",
      "provenance_prefix": "FUSBAL.PIPELINE.TASK_INT_010_IMP_007.SUB_001",
      "done_when": [
        "A versioned schema file exists at `pipeline/schemas/contract.v1.schema.json`.",
        "Schema is deterministic and aligns with contract code fields."
      ]
    },
    {
      "subtask_id": "SUB-TASK-INT-010-IMP-007-002",
      "title": "Document/encode the alignment between contract code version and JSON Schema version.",
      "status": "done",
      "area": "pipeline",
      "provenance_prefix": "FUSBAL.PIPELINE.TASK_INT_010_IMP_007.SUB_002",
      "done_when": [
        "There is an explicit version field or mapping between contract code and schema file.",
        "Downstream consumers can identify which schema version to use."
      ]
    }
  ]
}
